# GetSubface Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementBoundarySubface..::..GetSubface Method
SpatialElementBoundarySubface Class See Also
---
Returns a face that represents the portion of the room face bounded by the boundary element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Face GetSubface()
```

Visual Basic
---
```text
Public Function GetSubface As Face
```

Visual C++
---
```text
public:
Face^ GetSubface()
```

# ### Return Value
The sub-face.
# Remarks
If the spatial element's face is adjacent to multiple bounding elements (such as two different walls), there will be one sub-face for each portion of the spatial element's face where it is adjacent to one of those room-bounding elements. This is equivalent to the return of GetRoomFace() if the entire room face is created by the boundary element.
# See Also
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace